rottenpotatoes/app/controllers/movies_controller.rb

  def show
    id = params[:id]
    @movie = Movie.find(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 13]]

    def same_director
    @movie = Movie.find params[:id] # look up movie by unique ID
    @movies = Movie.where(:director => @movie.director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 11]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]